# 1단계 문제 (버블정렬 방법 사용해서 풀기)
'''
data_list = [91, 793, 908, 882, 695, 289, 703, 497, 579, 399, 
             166, 316, 330, 816, 336, 637, 524, 805, 925, 967, 
             97, 134, 186, 38, 756, 329, 864, 512, 632, 734, 778, 
             135, 648, 680, 62, 197, 445, 72, 839, 522, 161, 37, 
             589, 829, 969, 479, 260, 889, 873, 980, 850, 982, 948, 755, 
             272, 455, 787, 758, 494, 328, 461, 318, 577, 706, 526, 659, 
             450, 413, 378, 345, 477, 921, 142, 173, 774, 578, 212, 415, 
             169, 292, 79, 373, 565, 256, 403, 198, 433, 919, 501, 871, 232, 
             406, 47, 838, 245, 642, 117, 420, 588, 110]

for i in range(len(data_list)-1):
    for j in range(len(data_list)-1-i):
        if data_list[j] > data_list[j+1]:
            data_list[j], data_list[j+1] = data_list[j+1], data_list[j]
print(data_list)
'''
# 백준 정렬

# 2587번 대표값2
'''
nums = [int(input()) for _ in range(5)]
nums.sort()
print(sum(nums)//5)
print(nums[(len(nums)//2)])
'''

# 1436번 영화감독 숌
n = int(input())

cnt = 0 # <- 번째 수
# 무조건 666이 붙어있어야한다.
movie = 666 # <- movie는 계속 +1씩 업데이트 해야 되니깐 int 형으로
while cnt != n:
    if '666' in str(movie):
        cnt += 1
    movie += 1
print(movie-1)
